---
kind: method
id: M:Autodesk.Revit.DB.FabricationServiceButton.IsExcluded
source: html/0cbe64e6-fe07-ab38-953f-461691feefea.htm
---
# Autodesk.Revit.DB.FabricationServiceButton.IsExcluded Method

Gets if the button's fabrication part content associated with the button is to be excluded from Route and Fill, Design to Fabrication, or Multi-Point Routing commands.

## Syntax (C#)
```csharp
public bool IsExcluded()
```

## Returns
Returns true if the button's parts are excluded.